# -*- coding: utf-8 -*-
from tkinter import * #РёРјРїРѕСЂС‚РёСЂСѓРµРј РІСЃРµ РёР· РјРѕРґСѓР»СЏ С‚РєРёРЅС‚РµСЂ

РѕРєРЅРѕ = Tk() #РѕР±СЉСЏРІР»СЏРµРј РѕРєРЅРѕ
class РІС‹Р±РѕСЂ:
    def __init__(self):
        def РІС‹РІРѕРґ():
            selection = "You selected the option " + str(РїРµСЂРµРјРµРЅРЅР°СЏ.get())
            СЃС‚СЂРѕРєР°.config(text=selection)
        РїРµСЂРµРјРµРЅРЅР°СЏ = IntVar()
        РїРµСЂРµРјРµРЅРЅР°СЏ.set(1)
        СЃС‚СЂРѕРєР° = Label(РѕРєРЅРѕ)
        СЃС‚СЂРѕРєР°.pack(anchor=W)
        self.РІС‹Р±РѕСЂ1 = Radiobutton(РѕРєРЅРѕ, text="РёРЅСЊ", variable=РїРµСЂРµРјРµРЅРЅР°СЏ, value=0, command=РІС‹РІРѕРґ)
        self.РІС‹Р±РѕСЂ1.pack()
        self.РІС‹Р±РѕСЂ2 = Radiobutton(РѕРєРЅРѕ,text="СЏРЅСЊ", variable=РїРµСЂРµРјРµРЅРЅР°СЏ,value=1, command=РІС‹РІРѕРґ)
        self.РІС‹Р±РѕСЂ2.pack( anchor = W ) #СЂР°СЃРїРѕР»РѕР¶РµРЅРёРµ РєРЅРѕРїРєРё
        self.РІС‹Р±РѕСЂ3 = Radiobutton(РѕРєРЅРѕ,text="С…СЂРµРЅСЊ", variable=РїРµСЂРµРјРµРЅРЅР°СЏ,value=2, command=РІС‹РІРѕРґ)
        self.РІС‹Р±РѕСЂ3.pack( anchor = W )

class РёРјСЏ_РєР»Р°СЃСЃР°:
    def __init__(self):
        self.РёРјСЏ_РїРµСЂРµРјРµРЅРЅРѕР№ = Button(РѕРєРЅРѕ, #РћР±СЉСЏРІР»СЏРµРј РєРЅРѕРїРєСѓ Рё РµС‘ РїРµСЂРµРјРµРЅРЅС‹Рµ
                                     text="hell_ride", #РёРјСЏ РєРЅРѕРїРєРё
                                     width=30,height=5, #СЂР°Р·РјРµСЂ РєРЅРѕРїРєРё
                                     bg="black",fg="yellow") #С†РІРµС‚ С„РѕРЅР° Рё С‚РµРєСЃС‚Р°
        self.РёРјСЏ_РїРµСЂРµРјРµРЅРЅРѕР№.bind("<Button-1>", self.РїРµСЂРµРјРµРЅРЅР°СЏ_РїРµС‡Р°С‚Рё) #РЅР°Р¶Р°С‚РёРµ РєРЅРѕРїРєРё Рё С‡С‚Рѕ РѕРЅРѕ РґРµР»Р°РµС‚
        self.РёРјСЏ_РїРµСЂРµРјРµРЅРЅРѕР№.pack() #СЃР±РѕСЂРєР° РєРЅРѕР°РїРєРё
    def РїРµСЂРµРјРµРЅРЅР°СЏ_РїРµС‡Р°С‚Рё(self,event):
        print("РїРµС‡Р°С‚Р°РµРјС‹Р№ С‚РµРєСЃС‚!")
class РЅР°РєР»РµР№РєР°:
     def __init__(self):
         self.РЅР°РєР» = Label(РѕРєРЅРѕ, text="Р­С‚Рѕ РјРµС‚РєР°! \n Р�Р· РґРІСѓС… СЃС‚СЂРѕРє.", font="Arial 18")
         self.РЅР°РєР».pack()
class С‚РµСЃС‚_1СЃС‚СЂ:
    def __init__(self):
        self.РїРѕР»Рµ = Entry(РѕРєРЅРѕ,width=20,bd=3) #bd С€РёСЂРёРЅР° СЂР°РјРєРё
        self.РїРѕР»Рµ.pack()
class РјРЅРѕРіРѕ_Р±СѓРєР°С„:
    def __init__(self):
        self.РІРІРѕРґ = Text(РѕРєРЅРѕ,width=40,
          font="Verdana 12",
          wrap=WORD) #РїРµСЂРµРЅРѕСЃ РїРѕ СЃР»РѕРІР°Рј
        self.РІРІРѕРґ.pack()

class С„Р»Р°Р¶РєРё:
    РїРµСЂРµРјРµРЅРЅР°СЏ_С„Р»Р°РіР°1 = IntVar()
    РїРµСЂРµРјРµРЅРЅР°СЏ_С„Р»Р°РіР°2 = IntVar()
    С„Р»Р°Рі1 = Checkbutton(РѕРєРЅРѕ,text="РџРµСЂРІС‹Р№ С„Р»Р°Р¶РѕРє",
          variable=РїРµСЂРµРјРµРЅРЅР°СЏ_С„Р»Р°РіР°1,onvalue=1,offvalue=0)
    С„Р»Р°Рі1.pack()
    С„Р»Р°Рі2 =Checkbutton(РѕРєРЅРѕ,text="Р’С‚РѕСЂРѕР№ С„Р»Р°Р¶РѕРє",
          variable=РїРµСЂРµРјРµРЅРЅР°СЏ_С„Р»Р°РіР°2,onvalue=2,offvalue=0)
    С„Р»Р°Рі2.pack()


object = С‚РµСЃС‚_1СЃС‚СЂ()
object = РёРјСЏ_РєР»Р°СЃСЃР°() #РґРѕР±Р°РІР»СЏРµРј РѕР±СЉРµРєС‚
object = РЅР°РєР»РµР№РєР°()
object = РјРЅРѕРіРѕ_Р±СѓРєР°С„()
object = РІС‹Р±РѕСЂ()
РѕРєРЅРѕ.mainloop() #СЃРѕР·РґР°РµРј РѕРєРЅРѕ